# 0001 - Pandas Read and Write Data

In [1]:
import pandas as pd

### 1. Pandas Read and Write CSV

In [20]:
data = pd.read_csv('../Datasets/bank/bank.csv', sep =';')
data[0:5]['marital']

0    married
1     single
2    married
3    married
4    married
Name: marital, dtype: object

In [21]:
d = {'c1': pd.Series(['A', 'B', 'C']),
'c2': pd.Series([1, 2., 3., 4.])}
df = pd.DataFrame(d)
df.to_csv('save_data/sample_data.csv')

### 2. Pandas Read and write  XLS

In [22]:
d=pd.read_excel('../Datasets/athletes/downloaded_medals.xls') 
d[0:5]

,City,Discipline,Event,Event gender,Medal,NOC,Sport,Year
0,Chamonix,Figure skating,individual,M,Silver,AUT,Skating,1924
1,Chamonix,Figure skating,individual,W,Gold,AUT,Skating,1924
2,Chamonix,Figure skating,pairs,X,Gold,AUT,Skating,1924
3,Chamonix,Bobsleigh,four-man,M,Bronze,BEL,Bobsleigh,1924
4,Chamonix,Ice Hockey,ice hockey,M,Gold,CAN,Ice Hockey,1924

In [23]:
df.to_excel('save_data/medals.xls')

### 3. Pandas Read and write JSON

In [32]:
import json
json_data = open('../Datasets/data.json')
data = json.load(json_data)
json_data.close()

data["Geeks"][0:2]

[{'Geekname': 'Sahil kumar', 'subject': 'Data structures', 'Articles': 10},
 {'Geekname': 'Pawan singh', 'subject': 'Algorithms', 'Articles': 16}]

#### 4.1 Pandas read JSON

In [46]:
df = pd.read_json('../Datasets/data.json')
df["Geeks"]

0    {'Geekname': 'Sahil kumar', 'subject': 'Data s...
1    {'Geekname': 'Pawan singh', 'subject': 'Algori...
2    {'Geekname': 'Ayush Goel', 'subject': 'Network...
Name: Geeks, dtype: object

In [47]:
df["Geeks"][1]["Geekname"]

'Pawan singh'

#### 4.2 Pandas read JSON from url

In [33]:
url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/data.json'

df = pd.read_json(url, orient='columns')
df.head(10)

    integer            datetime  category
0         5 2015-01-01 00:00:00         0
1         5 2015-01-01 00:00:01         0
10        5 2015-01-01 00:00:10         0
11        5 2015-01-01 00:00:11         0
12        8 2015-01-01 00:00:12         0
13        9 2015-01-01 00:00:13         0
14        8 2015-01-01 00:00:14         0
15        8 2015-01-01 00:00:15         0
16        2 2015-01-01 00:00:16         0
17        1 2015-01-01 00:00:17         0

### 4. Read data from database

In [51]:
import pandas as pd
import pyodbc

sql_conn = pyodbc.connect('DRIVER=SQL Server Native Client 11.0;SERVER=MYEQ-PC;DATABASE=v0011129_reader_news;Trusted_Connection=yes') 
query = "SELECT * FROM [dbo].[news]"
df = pd.read_sql(query, sql_conn)

df.head(3)

,IdNew,IdNewsPaper,IdChannel,Title,Description,PublishDate,Link,Author,Created
0,1,6,21,"Maidana sorprendió con su atuendo: ""Vengo a ha...",El Chino apareció en la conferencia de prensa ...,2014-09-10 20:26:00,http://www.clarin.com/deportes/Floyd_Mayweathe...,,2014-09-10 22:49:44.017
1,2,6,21,"Magnano: ""Este Brasil no merecía irse así del ...",Tras la estrepitosa caída ante Serbia en cuart...,2014-09-10 19:38:34,http://www.clarin.com/deportes/Magnano-Brasil-...,,2014-09-10 22:49:44.063
2,3,6,21,"El nuevo estadio de San Lorenzo se llamará ""Pa...",,2014-09-10 19:20:00,http://www.clarin.com/deportes/estadio-San-Lor...,,2014-09-10 22:49:44.077